import React from 'react';

function AgreementText() {
  return (
    <div>
      <p className="text">Настоящее Пользовательское соглашение (далее - Соглашение) представляет собой </p>
      <p className="text">публичную оферту в соответствии со ст.435 Гражданского кодекса Российской </p>
      <p className="text">Федерации и регулирует отношения по использованию услуги билайн тв </p>
      <p className="text">(далее - Услуга) и общие условия оказания Услуг между Публичным акционерным </p>
      <p className="text">обществом «Вымпел-Коммуникации» (ОГРН 1027700166636; ИНН 7713076301), </p>
      <p className="text">которое является юридическим лицом, созданным на территории Российской Федерации </p>
      <p className="text"> и в соответствии с законодательством Российской Федерации, (далее - Оператор), </p>
      <p className="text">с одной стороны, и любым совершеннолетним физическимлицом, принявшим </p>
      <p className="text">условия Соглашения и осуществившим доступ к услуге билайн тв путём присоединения к </p>
      <p className="text">
        Соглашению в целом и безоговорочно (далее — Клиент), с другой стороны, далее при
        совместном упоминании — Стороны, а по отдельности — Сторона.
      </p>
      <p className="text">
        В случае несогласия с какими-либо условиями Соглашения, рекомендуем воздержаться от
        использования Услуги в какой-либо форме.
        <br />
      </p>
      <p className="text">
        Датой заключения Соглашения признается дата начала использования Услуги.
        <br />
      </p>
      <h3 className="text">
        Термины
        <br />
      </h3>
      <p className="text">
        Оператор — Публичное акционерное общество «Вымпел — Коммуникации».
        <br />
      </p>
      <p className="text">
        Абонент (Абонент билайн) — физическое лицо, пользователь услуг связи Оператора,
        заключивший договор
      </p>
      <p className="text">об оказании услуг связи билайн (договоры на оказание услуг подвижной </p>
      <p className="text">радиотелефонной связи, телематических услуг связи, услуг связи по </p>
      <p className="text">передаче данных, услуг связи для целей телевещания), принявший условия Соглашения</p>
      <p className="text"> и зарегистрированный в Услуге с помощью мобильного номера или уникального </p>
      <p className="text">
        идентификатора.
        <br />
        Пользователь — физическое лицо (гражданин), не являющееся
      </p>
      <p className="text">
        Абонентом, заключившее Соглашение с Оператором.
        <br />
        Клиент— Абонент,
      </p>
      <p className="text">
        Пользователь при совместном упоминании их в тексте Соглашения.
        <br />
      </p>
      <p className="text">Абонентское устройство — находящееся в законном владении Клиента (оконечное) </p>
      <p className="text">оборудование, обеспечивающие Клиенту доступ к Контенту и/или возможность его </p>
      <p className="text">просмотра. С перечнем Абонентских устройств можно ознакомиться на сайте Услуги </p>
      <p className="text">
        beeline.tv (далее — Сайт Услуги).
        <br />
        Плата за Услугу — размер платежа Клиента
      </p>
      <p className="text">
        за оказанную Услугу.
        <br />
        Видеоконтент — аудиовизуальные произведения, которые
      </p>
      <p className="text"> предоставляются Клиенту, если иное не указано на Сайте Услуги. Перечень</p>
      <p className="text"> Видеоконтента, а также срок доступа к Видеоконтенту определяются Оператором </p>
      <p className="text">
        самостоятельно и доступны для Клиента в Интерфейсах Услуги. Под Единицей
        Видеоконтента
      </p>
      <p className="text">следует понимать одно аудиовизуальное произведение.</p>
    </div>
  );
}

export default AgreementText;
